[
  {
    "question": "What did you do last weekend? Describe your activities in detail."
  },
  {
    "question": "Describe your favorite hobby. Why do you enjoy it so much?"
  },
  {
    "question": "What are your plans for the next holiday? (e.g., vacation, family gatherings, etc.)"
  },
  {
    "question": "If you could travel anywhere in the world, where would you go and why?"
  },
  {
    "question": "What is your opinion on remote work (working from home)? Discuss its pros and cons."
  },
  {
    "question": "What motivates you to keep improving yourself, even when things get difficult?"
  },
  {
    "question": "Describe a memorable experience that changed your perspective on something important."
  },
  {
    "question": "Do you think artificial intelligence will create more jobs or take them away? Explain your reasoning."
  },
  {
    "question": "If you could have dinner with any historical figure, who would it be and what would you ask them?"
  },
  {
    "question": "How do you define success, and has that definition changed over time?"
  },
  {
    "question": "What are some habits or routines that help you stay productive?"
  },
  {
    "question": "Do you prefer working in a team or alone? Why?"
  },
  {
    "question": "What is one technological invention you can’t live without, and why?"
  },
  {
    "question": "If you could instantly learn a new skill, what would it be and how would you use it?"
  },
  {
    "question": "What are the advantages and disadvantages of social media in modern society?"
  },
  {
    "question": "What is a leader?"
  },
  {
    "question": "Who are the first leaders who come to your mind?"
  },
  {
    "question": "What makes those people great leaders?"
  },
  {
    "question": "What are the qualities or characteristics that every leader should have?"
  },
  {
    "question": "Are some people natural leaders and other people natural followers? Why?"
  },
  {
    "question": "What are some of the biggest challenges of leading a country like China?"
  },
  {
    "question": "Would you like to be a leader in China? Why or why not?"
  },
  {
    "question": "Why do some people think it's a bad thing to always follow other people?"
  },
  {
    "question": "What characteristics does a bad leader have?"
  },
  {
    "question": "If you were the leader of your school, what changes would you make?"
  },
  {
    "question": "Do you think English is a difficult language to learn?"
  },
  {
    "question": "Have you ever spoken English on the phone?"
  },
  {
    "question": "How often do you practice your English?"
  },
  {
    "question": "What is your favorite way to practice your English? (UK spelling = favorite)"
  },
  {
    "question": "What is the most difficult thing about English?"
  },
  {
    "question": "Why are you learning English?"
  },
  {
    "question": "What do you think you will be able to do in English in the future?"
  },
  {
    "question": "Do you think that English will completely dominate all the other languages in the future? If yes, how will it affect the world?"
  },
  {
    "question": "How much time do you spend looking out of the window during class?"
  },
  {
    "question": "If you are really absorbed in lessons, do the classroom arrangement matter?"
  },
  {
    "question": "How do you use the Internet to learn English?"
  },
  {
    "question": "What search engine do you use most often when you study? Why?"
  },
  {
    "question": "Do you think English is a difficult language to learn?"
  },
  {
    "question": "What is your favorite way to practice your English?"
  },
  {
    "question": "What do you think you will be able to do in English in the future?"
  },
  {
    "question": "How can English language help you advance in your career?"
  },
  {
    "question": "Which country is the best place to study English?"
  },
  {
    "question": "Are you willing to get a tutor just to further learn English?"
  },
  {
    "question": "What is the best way to teach vocabulary at the upper intermediate level EFL?"
  },
  {
    "question": "What kind of dormitory room would you like to stay in?"
  },
  {
    "question": "In your own teaching environment what forms of pronunciation of English are learners likely to encounter?"
  },
  {
    "question": "How can I listen to conversations and improve my pronunciation?"
  },
  {
    "question": "What do you like about your classroom?"
  },
  {
    "question": "Who cooks Thanksgiving dinner in your home?"
  },
  {
    "question": "How do you cook the turkey?"
  },
  {
    "question": "When do you eat?"
  },
  {
    "question": "Why do you think people celebrate Thanksgiving Day?"
  },
  {
    "question": "Can you tell me something about yourself?"
  },
  {
    "question": "What do you know about our organization?"
  },
  {
    "question": "Why do you want to work for us?"
  },
  {
    "question": "What can you do for us that someone else can't?"
  },
  {
    "question": "What do you find most attractive about this position?"
  },
  {
    "question": "What seems least attractive about it?"
  },
  {
    "question": "Why should we hire you?"
  },
  {
    "question": "What do you look for in a job?"
  },
  {
    "question": "Please give me your definition of the position for which you are being interviewed."
  },
  {
    "question": "How long would it take you to make a meaningful contribution to our firm?"
  },
  {
    "question": "How long would you stay with us?"
  },
  {
    "question": "Your resume suggests that you may be over-qualified or too experienced for this position. What's your opinion?"
  },
  {
    "question": "What is your management style?"
  },
  {
    "question": "Are you a good manager?"
  },
  {
    "question": "Can you give me some examples?"
  },
  {
    "question": "Do you feel that you have top managerial potential?"
  },
  {
    "question": "What do you look for when you hire people?"
  },
  {
    "question": "Have you ever had to fire people?"
  },
  {
    "question": "What were the reasons?"
  },
  {
    "question": "How did you handle the situation?"
  },
  {
    "question": "What do you think is the most difficult thing about being a manager or executive?"
  },
  {
    "question": "What important trends do you see in our industry?"
  },
  {
    "question": "Why are you leaving (did you leave) your present (last) job?"
  },
  {
    "question": "How do you feel about leaving all your benefits to find a new job?"
  },
  {
    "question": "In your current (last) position, what features do (did) you like the most? The least?"
  },
  {
    "question": "What do you think of your boss?"
  },
  {
    "question": "Why aren't you earning more at your age?"
  },
  {
    "question": "What do you feel this position should pay?"
  },
  {
    "question": "What are your long-range goals?"
  },
  {
    "question": "How successful have you been so far?"
  },
  {
    "question": "Why do you want to work for this company?"
  },
  {
    "question": "What high school did you attend?"
  },
  {
    "question": "Are you married? Can you tell me about your family?"
  },
  {
    "question": "Why did you leave your last job?"
  },
  {
    "question": "What are your long-range career objectives?"
  },
  {
    "question": "What would you like to do in the future?"
  },
  {
    "question": "What do you do in your free time?"
  },
  {
    "question": "Are you qualified for this position?"
  },
  {
    "question": "How well do you work with people?"
  },
  {
    "question": "What is a good working environment for you?"
  },
  {
    "question": "Why should I hire you?"
  },
  {
    "question": "What was a movie you saw recently that impressed you?"
  },
  {
    "question": "Do you enjoy traveling?"
  },
  {
    "question": "Why do you think we should hire you for this job?"
  }
]
